---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FloorFailures.FloorSlopeExceedsThreshold
source: html/aaf96408-8aa7-0250-6b0d-240257dc21f5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FloorFailures.FloorSlopeExceedsThreshold Property

Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in
 sections and details may not accurately indicate the Thickness shown in Type Properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorSlopeExceedsThreshold { get; }
```